---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RbsElecPanelBranchCircuitApparentLoadPhasec
source: html/7ce33511-eb11-1757-5366-89c5d37c521b.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RbsElecPanelBranchCircuitApparentLoadPhasec Property

"Branch Circuit Apparent Load Phase C"

## Syntax (C#)
```csharp
public static ForgeTypeId RbsElecPanelBranchCircuitApparentLoadPhasec { get; }
```